#define _CRT_SECURE_NO_WARNINGS 1
#include <stdio.h>

// 写代码判断当前的字节序
//int main()
//{
//	int i = 1;
//	char* p = (char*)&i;//强制类型转换char*，char*每次访问一个字节
//	if (*p == 0)
//		printf("大端\n");
//	else
//		printf("小端");
//	return 0;
//}



//输出什么？
//int main()
//{
//	char a = -1;
//	//10000000000000000000000000000001
//	//11111111111111111111111111111110
//	//11111111111111111111111111111111
//	//11111111
//	signed char b = -1;
//	//11111111
//	unsigned char c = -1;
//	//11111111
//	//00000000000000000000000011111111
//	printf("a=%d,b=%d,c=%d", a, b, c);// -1  -1  128
//	return 0;
//}

//补充：
//1. char到底是signed char还是unsigned char?
//c语言标准并没有规定，取决于编译器
//
//int 是 signed int
//short 是 signed short



//int main()
//{
//	char a = -128;
	//100000000000000010000000
	//111111111111111101111111
	//111111111111111110000000-补码
	//10000000
	//111111111111111110000000
//	printf("%u\n", a);
//	return 0;
//}

//char范围
//有符号的char取值范围为 -128~127
//其中01111111为127, 10000000为-128



//int main()
//{
//	int i = -20;
//	//100000000000000000010100
//	//111111111111111111101011
//	//111111111111111111101100
//	unsigned int j = 10;
//	//000000000000000000001010
//	printf("%d\n", i + j);//-10
//	//111111111111111111101100
//	//000000000000000000001010
//	//111111111111111111110110 -补码 
//	//111111111111111111110101
//	//000000000000000000001010 -> -10
//	return 0;
//}



//int main()//死循环
//{
//	unsigned int i;
//	for (i = 9; i >= 0; i--)
//	{
//		printf("%u\n", i);
//	}
//	return 0;
//}



//#include <string.h>
//int main()
//{
//	char a[1000];
//	int i;
//	for (i = 0; i < 1000; i++)
//	{
//		a[i] = -1 - i;
//	}
//	//-1 -2 -3 .... -127 -128 127 126 125 ..... 3 2 1 0 -1 -2 ..... -127 -128 127 ..... 
//	printf("%d", strlen(a));//255
//	//找到\0 -> 0
//	return 0;
//}



//unsigned char i = 0;
//
//int main()
//{
//	for (i = 0; i <= 255; i++)
//	{
//		printf("hello world\n");//死循环
//	}
//	return 0;
//}
 


int main()
{
	int n = 9;

	float* pFloat = (float*)&n;
	printf("n的值为：%d\n", n);//9
	printf("*pFloat的值为：%f\n", *pFloat);//
	
	*pFloat = 9.0;
	printf("num的值为：%d\n", n);//
	printf("*pFloat的值为：%f\n", *pFloat);//

	return 0;
}